Revit 2024 API
LabelType Enumeration
 The label type in dimension equality formats.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Since: 2017 Subscription Update
Syntax
C#
public enum LabelType
Visual Basic
Public Enumeration LabelType
Visual C++
public enum class LabelType
Members
Member name | Description
NumberOfWitnessLines |  The number of witness lines of the dimension.
NumberOfSegments |  The number of segments of the dimension.
LengthOfSegment |  The length of segments of the dimension.
TotalLength |  The total length of the dimension.
See Also
Autodesk.Revit.DB Namespace